"use strict";
alert("text!");
alert("Привет, мир!");

// Вот пример многострочного комментария:
/*
	комментарий
*/
// Вот пример однострочного комментария:
// SDFGHJK,L

// Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.
let num = 123;
alert(num);

let a = 1;
let b = 2;
let c = 3;

// Приведенный выше код можно упростить, написав let один раз и после него перечислив нужные переменные с их значениями, вот так:
let a = 1,
  b = 2,
  c = 3;

// Можно вначале объявить все переменные, а потом присваивать им значения:
let a, b, c; // объявляем все 3 переменные
// Присваиваем переменным значения:
a = 1;
b = 2;
c = 3;
