"use strict";
// alert("text!");
// alert("Привет, мир!");

// Вот пример многострочного комментария:
/*
	комментарий
*/
// Вот пример однострочного комментария:
// SDFGHJK,L

// Создайте переменную num и присвойте ей значение 123. Выведите значение этой переменной на экран с помощью функции alert.
// let num = 123;
// alert(num);

let a = 1;
let b = 2;
let c = 3;

// Приведенный выше код можно упростить, написав let один раз и после него перечислив нужные переменные с их значениями, вот так:
let d = 1,
  e = 2,
  f = 3;

// Можно вначале объявить все переменные, а потом присваивать им значения:
let g, h, i; // объявляем все 3 переменные
// Присваиваем переменным значения:
g = 1;
h = 2;
i = 3;

// Создайте переменную a. Запишите в нее значение 10, выведите его на экран. Затем запишите в нее значение 20, выведите его на экран.
// let j;
// j = 20;
// alert(j);

// Одну и ту же переменную нельзя объявить несколько раз через let. К примеру, следующий код приведет к ошибке:
// let a = 1;
// alert(a);

// let a = 2;
// alert(a);

// А можно вначале объявить переменную a, а затем делать операции с нею:

let k;

k = 1;
alert(k);

k = 2;
alert(k);
